app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 28]]
---

<% @user.posts.each do |post| %> </p>