app/controllers/comments_controller.rb

  def create
    # byebug
    @comment = Comment.create(content:params[:content],post_id: params[:post_id],user_id:session[:id])
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "This is a great post "], ["user_id", 12], ["post_id", 23], ["created_at", "2019-01-22 14:05:08.111370"], ["updated_at", "2019-01-22 14:05:08.111370"]]