app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "sender_id", "receiver_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hi, I love your post "], ["sender_id", 27], ["receiver_id", 24], ["created_at", "2019-01-23 16:58:29.543888"], ["updated_at", "2019-01-23 16:58:29.543888"]]
---
  def create
    # byebug
    @text = Message.create(mess_params(:content,:sender_id,:receiver_id))