app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
  def index
    @user = User.find(session[:id])
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def new
    @user = User.find(session[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
---
  def show
    # byebug
    @message = Message.new
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "recipe", "user_id", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["recipe", ""], ["user_id", 24], ["img_url", ""], ["created_at", "2019-01-24 11:13:22.774485"], ["updated_at", "2019-01-24 11:13:22.774485"]]
---
  def create
    # uploaded_io = params[:post][:img_url]
     # byebug
    # picture = File.open(Rails.root.join(‘public’, ‘uploads’, uploaded_io.original_filename), ‘wb’) do |file|
    #   file.write(uploaded_io.read)
    @post = Post.create(
      title: params[:post][:title],
      recipe: params[:post][:recipe],
      img_url: params[:post][:img_url],
      user_id: session[:id])