app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    # byebug
    @user = User.find(session[:id])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "London"], ["created_at", "2019-01-22 09:32:03.565434"], ["updated_at", "2019-01-22 09:32:03.565434"]]
---
  def create
    # byebug
    @user = User.create(user_params)